In [17]:
import pandas as pd

In [18]:
dados = pd.read_csv("nomes_nasc.csv", delimiter=";", encoding="utf-8")

In [19]:
# Vamos:
# 1ª - Deletar a coluna ID
# 2ª - Deixar todos os textos em minúsculo
# 3ª - Coluna "Data Nascimento", mudar de object para timestamp
# 4ª - Salario está no formato string, mudar para float
# 5ª - Pais (Port para Potugal), (Brazil para Brazil), (Eua/USA para Estados Unidos)
dados

   id                Nome Data Nascimento     Salario            Pais
0   1          Jose maria      1997/06/23    1,945.42            Port
1   2         Maria Lucia      1983/03/09      950.33          Brazil
2   3   Francisco Augusto      2010/04/03    6,323.19          Brasil
3   4         Mendes Lima      2008/07/16    4,345.89          Brasil
4   5      victor Pereira      1998/08/14    1,045.18             Eua
5   6     Eloisa Carvalho      1990/09/23   10,034.20  Estados Unidos
6   7  Aparecida Josefina      1979/03/07    2,339.23             USA
7   8         Aline Alves      1987/03/23  2,4,455.99        Portugal
8   9     irton augustino      1995/09/23     1750.00            Port
9  10       Creusa Soares      1970/12/24     1045.00          Brasil

In [20]:
# Verificar tipos das colunas
dados.dtypes

id                  int64
Nome               object
Data Nascimento    object
Salario            object
Pais               object
dtype: object

In [21]:
# 1ª - Deletar a coluna ID
dados.drop('id', axis=1, inplace=True)

In [34]:
# 2ª - Deixar todos os textos em minúsculo
dados.columns = dados.columns.str.lower()
dados.nome    = dados.nome.str.lower()
dados.pais    = dados.pais.str.lower()

In [38]:
# 3ª - Coluna "Data Nascimento", mudar de object para timestamp
dados['data nascimento'] = pd.to_datetime(dados['data nascimento'])

In [41]:
# 4ª - Salario está no formato string, mudar para float
dados.salario = dados.salario.str.replace(',','').astype(float)

In [47]:
# 5ª - Pais (Port para Potugal), (Brazil para Brazil), (Eua/USA para Estados Unidos)
dados.pais.unique()

array(['port', 'brazil', 'brasil', 'eua', 'estados unidos', 'usa',
       'portugal'], dtype=object)

In [48]:
dicionarioPaises = {
    'port': 'portugal', 
    'brazil': 'brasil', 
    'brasil': 'brasil', 
    'eua': 'estados unidos', 
    'estados unidos': 'estados unidos', 
    'usa': 'estados unidos',
    'portugal': 'portugal'
}

dados.pais = dados.pais.apply(lambda nome: dicionarioPaises[nome])

0          portugal
1            brasil
2            brasil
3            brasil
4    estados unidos
5    estados unidos
6    estados unidos
7          portugal
8          portugal
9            brasil
Name: pais, dtype: object